Revit 2024 API
BuiltInFailures.StairRampFailures.InvalidStartLevelRamp Property
 The start level and end level for this ramp must be at different elevations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidStartLevelRamp { get; }
Visual Basic
Public Shared ReadOnly Property InvalidStartLevelRamp As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidStartLevelRamp {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace